
 main: proc options(main);
 %include net;

   dcl conn like conncb;
   dcl hostname char(256) varying init('www.example.com');

   on condition(net_error) begin;
     put skip list('Resolution failed, errno =', oncode());
     stop;
   end;

   call net_new(conn, AF.INET, TYPE.STREAM, 0);
   call net_resolve(conn, hostname);

   put skip list('Resolved', hostname, 'to', trim(sock._host));

 end;