
 main: proc options(main);
 %include socket;

   dcl sock like socket_t;
   dcl hostname char(256) varying init('www.example.com');

   on condition(socket_error) begin;
     put skip list('Resolution failed, errno =', oncode());
     stop;
   end;

   call new_socket(sock, AF.INET, TYPE.STREAM, 0);
   call socket_resolve(sock, hostname);

   put skip list('Resolved', hostname, 'to', trim(sock._host));

 end;